tests/unit/responses/funds/samples/currency_exposure_profile.json

{
    "currencyExposureProfile": {
        "result": [
            {
                "code": "0",
                "value": "ללא חשיפה"
            },
            {
                "code": "A",
                "value": "עד 10% מהשווי הנקי של נכסי הקרן"
            },
            {
                "code": "B",
                "value": "עד 30% מהשווי הנקי של נכסי הקרן"
            },
            {
                "code": "C",
                "value": "עד 50% מהשווי הנקי של נכסי הקרן"
            },
            {
                "code": "D",
                "value": "עד 120% מהשווי הנקי של נכסי הקרן"
            },
            {
                "code": "E",
                "value": "עד 200% מהשווי הנקי של נכסי הקרן"
            },
            {
                "code": "F",
                "value": "מעל 200% מהשווי הנקי של נכסי הקרן"
            }
        ],
        "total": 7
    }
}